Revit 2022 API
AnalyticalModelSurface.GetLocalCoordinateSystem Method
Overload List
Name | Description
GetLocalCoordinateSystem()
 Gets the local coordinate system (LCS) for an analytical model element.
 (Inherited from AnalyticalModel.)
GetLocalCoordinateSystem(XYZ)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
See Also
AnalyticalModelSurface Class
AnalyticalModelSurface Members
Autodesk.Revit.DB.Structure Namespace